-- Завдання 2
-- Для бази даних «Таблиця» створіть такі запити:
-- 1. Вивести вміст таблиці палат.
SELECT * 
FROM Wards

-- 2. Вивести прізвища та телефони усіх лікарів.

SELECT SURNAME, PHONE
FROM DOCTORS

-- 3. Вивести усі поверхи без повторень, де розміщуються
-- палати.

CREATE TABLE Wards(
	ID SERIAL NOT NULL PRIMARY KEY,
	Building INT NOT NULL CHECK (Building BETWEEN 1 AND 5),
	Floor INT NOT NULL CHECK (Floor>=1),
	Name VARCHAR(20) UNIQUE NOT NULL CHECK(Name != '')
)

SELECT DISTINCT Floor
FROM Wards
ORDER BY Floor --sort

-- 4. Вивести назви захворювань під назвою « Name of
-- Disease» та ступінь їхньої тяжкості під назвою «Severity
-- of Disease».

CREATE TABLE DISEASES(
	ID SERIAL NOT NULL PRIMARY KEY,
	NAME VARCHAR(100) NOT NULL CHECK(NAME != '') UNIQUE,
	SEVERITY INT NOT NULL CHECK(SEVERITY > 1) DEFAULT 1
)

SELECT NAME AS "Name of Disease", SEVERITY AS "Severity of Disease"
FROM DISEASES

-- 5. Вивести назви відділень, які знаходяться у корпусі 5
-- з фондом фінансування меншим, ніж 30000.


SELECT NAME 
FROM DEPARTMENTS
WHERE BUILDING = 5 AND FINANCING < 100000

-- 6. Вивести назви відділень, які знаходяться у корпусі 3 з
-- фондом фінансування у діапазоні від 12000 до 15000


SELECT NAME 
FROM DEPARTMENTS
WHERE BUILDING = 3 AND FINANCING BETWEEN 70000 AND 90000

-- Вивести назви палат, які знаходяться у корпусах 4 та
-- 5 на 1-му поверсі.
-- 9. Вивести назви, корпуси та фонди фінансування відділень, які знаходяться у корпусах 3 або 6 та мають
-- фонд фінансування менший, ніж 11000 або більший
-- за 25000.
-- 10. Вивести прізвища лікарів, зарплата (сума ставки та
-- надбавки 120) яких перевищує 1500.
-- 11. Вивести прізвища лікарів, у яких половина зарплати
-- перевищує триразову надбавку у вигляді 500.
-- 12. Вивести назви обстежень без повторень, які проводяться у перші три дні тижня з 12:00 до 15:00.
-- 13. Вивести назви та номери корпусів відділень, які знаходяться у корпусах 1, 3, 8 або 10.
-- 14. Вивести назви захворювань усіх ступенів тяжкості,
-- крім 1-го та 2-го.
-- 15. Вивести назви відділень, які не знаходяться у
-- першому або третьому корпусі.
-- 16. Вивести назви відділень, які знаходяться у першому 
-- або третьому корпусі.
-- 17. Вивести прізвища лікарів, що починаються з літери
-- «N»