CREATE TABLE PERSON(
	ID SERIAL PRIMARY KEY,
	FIRST_NAME VARCHAR(20) NOT NULL, -- НЕ МОЖЕ БУТИ ПРОПУСКУ
	LAST_NAME VARCHAR(20) UNIQUE, -- МАЮТЬ БУТИ ІНІКАЛНИМИ(БЕЗ ПОВТОРІВ)
	AGE INT CHECK(AGE > 0), -- НЕ МОЖЕ БУТИ ВІД'ЄМНИМ
	CITY VARCHAR(30) DEFAULT 'ЗАПОРІЖЖЯ',  -- ЗА ЗАМОВЧУВАННЯМ, ВВАЖАЄМО ЩО ЗАПОРІЖЖЯ
	BIRTH_DATE DATE NOT NULL CHECK(BIRTH_DATE > '1925-01-01')
)


-- ЗАПОВНЕННЯ
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Іван', 'Шевченко', 25, 'Київ', '1999-03-15');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Марія', 'Ковальчук', 30, 'Львів', '1994-07-22');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Андрій', 'Петренко', 28, DEFAULT, '1996-01-10');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Оксана', 'Мельник', 22, 'Одеса', '2002-11-05');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Сергій', 'Захарченко', 35, 'Харків', '1989-06-17');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Олена', 'Гончаренко', 26, DEFAULT, '1998-04-08');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Дмитро', 'Романюк', 31, 'Тернопіль', '1993-12-01');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Наталія', 'Кузьменко', 27, 'Рівне', '1997-05-19');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Віктор', 'Семенов', 29, DEFAULT, '1995-09-30');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Ірина', 'Ткаченко', 24, 'Черкаси', '2000-02-14');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Руслан', 'Гриценко', 32, 'Івано-Франківськ', '1992-10-10');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Юлія', 'Данилюк', 33, DEFAULT, '1991-08-25');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Тарас', 'Кравченко', 23, 'Хмельницький', '2001-06-03');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Світлана', 'Литвин', 34, 'Полтава', '1990-04-27');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Олег', 'Яценко', 21, DEFAULT, '2003-12-12');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Катерина', 'Чорна', 36, 'Чернівці', '1988-03-03');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Артур', 'Бондар', 20, 'Житомир', '2004-09-21');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Лілія', 'Мазур', 38, DEFAULT, '1986-01-01');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Євген', 'Савчук', 27, 'Ужгород', '1997-07-07');
INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('Аліна', 'Зінченко', 22, 'Дніпро', '2002-10-20');

-- ПОГАНІ ДАНІ
--INSERT INTO PERSON (FIRST_NAME, LAST_NAME, AGE, CITY, BIRTH_DATE) VALUES ('А', 'Б', 22, 'Дніпро', '1802-10-20');
INSERT INTO PERSON (FIRST_NAME, BIRTH_DATE) VALUES ('А', '2002-10-20');

SELECT *
FROM PERSON



-- ¾ Відділення (Departments)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор відділення.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Корпус (Building). Номер корпусу, в якому знаходиться
-- відділення.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Має бути в діапазоні від 1 до 5.
-- ■ Фінансування (Financing). Фонд фінансування відділення.
-- ▷ Тип даних для зберігання грошових значень.
-- ▷ Не містить null-значення.
-- ▷ Не може бути менше, ніж 0.
-- ▷ Значення за замовчуванням — 0.
-- ■ Назва (Name). Назва відділення.
-- ▷ Тип даних — varchar(100).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.
CREATE TABLE DEPARTMENTS(
	ID SERIAL NOT NULL PRIMARY KEY,
	BUILDING INT NOT NULL CHECK(BUILDING >= 1 AND BUILDING <= 5),
	FINANCING FLOAT NOT NULL CHECK(FINANCING >= 0) DEFAULT 0,
	NAME VARCHAR(100) NOT NULL CHECK(NAME != '') UNIQUE
)

INSERT INTO DEPARTMENTS (BUILDING, FINANCING, NAME) VALUES
(1, 85000, 'Кафедра анатомії'),
(2, 92000, 'Кафедра фізіології'),
(3, 78000, 'Кафедра фармакології'),
(4, 89000, 'Кафедра патології'),
(5, 95000, 'Кафедра мікробіології'),
(1, 87000, 'Кафедра хірургії'),
(2, 91000, 'Кафедра терапії'),
(3, 88000, 'Кафедра гінекології'),
(4, 86000, 'Кафедра педіатрії'),
(5, 94000, 'Кафедра інфекційних хвороб');

SELECT *
FROM DEPARTMENTS

-- ¾ Захворювання (Diseases)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор 
-- захво-рювання.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Назва (Name). Назва захворювання.
-- ▷ Тип даних — varchar(100).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.
-- ■ Ступінь тяжкості (Severity). Ступінь тяжкості захворювання.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Не може бути менше, ніж 1.
-- ▷ Значення за замовчуванням — 1.
CREATE TABLE DISEASES(
	ID SERIAL NOT NULL PRIMARY KEY,
	NAME VARCHAR(100) NOT NULL CHECK(NAME != '') UNIQUE,
	SEVERITY INT NOT NULL CHECK(SEVERITY > 1) DEFAULT 1
)

INSERT INTO DISEASES (NAME, SEVERITY) VALUES
('Грип', 3),
('Пневмонія', 5),
('Ангіна', 2),
('Бронхіт', 3),
('COVID-19', 6),
('Туберкульоз', 7),
('Цукровий діабет', 6),
('Гіпертонія', 4),
('Астма', 5),
('Гепатит B', 6),
('Гепатит C', 7),
('Менінгіт', 8),
('Отит', 2),
('Скарлатина', 4),
('Кір', 5),
('ВІЛ/СНІД', 9),
('Рак легенів', 10),
('Інфаркт міокарда', 9),
('Інсульт', 8),
('Дизентерія', 4);

SELECT *
FROM DISEASES

-- ¾ Лікарі (Doctors)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор
-- лікаря.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Ім’я (Name). Ім’я лікаря.
-- ▷ Тип даних — varchar(255).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожнє.
-- ■ Телефон(Phone). Телефонний номер лікаря.
-- ▷ Тип даних — char(10).
-- ▷ Може містити null-значення.
-- ■ Ставка (Salary). Ставка лікаря.
-- ▷ Тип даних для зберігання грошових значень.
-- ▷ Не містить null-значення.
-- ▷ Не може бути меншою або дорівнювати 0.
-- ■ Прізвище (Surname). Прізвище лікаря.
-- ▷ Тип даних — varchar(255).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожнє.
DROP TABLE DOCTORS

CREATE TABLE DOCTORS(
	ID SERIAL NOT NULL PRIMARY KEY,
	NAME VARCHAR(255) NOT NULL CHECK(NAME != ''),
	PHONE CHAR(10),
	SALARY FLOAT NOT NULL CHECK(SALARY > 0),
	SURNAME VARCHAR(255) NOT NULL CHECK(SURNAME != '')	
)

INSERT INTO DOCTORS (NAME, SURNAME, PHONE, SALARY) VALUES
('Олена', 'Іваненко', '0501234567', 18000),
('Андрій', 'Петренко', '0502345678', 22000),
('Марина', 'Сидорчук', '0503456789', 17000),
('Ігор', 'Ковальчук', '0504567890', 25000),
('Наталія', 'Мельник', '0505678901', 21000),
('Юрій', 'Бондаренко', '0506789012', 23000),
('Тетяна', 'Гриценко', '0507890123', 19000),
('Василь', 'Дмитрук', '0508901234', 20000),
('Оксана', 'Романюк', '0509012345', 19500),
('Олександр', 'Литвин', '0500123456', 22500),
('Людмила', 'Захарченко', '0671234567', 18500),
('Микола', 'Кравець', '0672345678', 21000),
('Вікторія', 'Савчук', '0673456789', 17500),
('Денис', 'Ткаченко', '0674567890', 24000),
('Олена', 'Федорчук', '0675678901', 20500),
('Віктор', 'Черниш', '0676789012', 19800),
('Інна', 'Білоус', '0677890123', 20200),
('Юлія', 'Шевченко', '0678901234', 19300),
('Артем', 'Яременко', '0679012345', 21700),
('Валентина', 'Гончар', '0670123456', 18900),
('Богдан', 'Онищенко', '0931234567', 26000),
('Олена', 'Козак', '0932345678', 21200),
('Олег', 'Довгань', '0933456789', 23000),
('Вікторія', 'Павлюк', '0934567890', 18000),
('Євген', 'Зінченко', '0935678901', 20000),
('Наталя', 'Мірошниченко', '0936789012', 17000),
('Ілля', 'Василенко', '0937890123', 19500),
('Роман', 'Шевчук', '0938901234', 21500),
('Ірина', 'Остапчук', '0939012345', 18500),
('Тарас', 'Матвієнко', '0930123456', 22500),
('Вікторія', 'Деркач', '0681234567', 19200),
('Марина', 'Коломієць', '0682345678', 18900),
('Артем', 'Гаврилюк', '0683456789', 24000),
('Яна', 'Тарасюк', '0684567890', 20500),
('Сергій', 'Кирилюк', '0685678901', 19000),
('Надія', 'Паламарчук', '0686789012', 17200),
('Юрій', 'Голуб', '0687890123', 22800),
('Ігор', 'Погорілий', '0688901234', 20000),
('Олександра', 'Лещенко', '0689012345', 18600),
('Владислав', 'Бабенко', '0680123456', 21400);

SELECT *
FROM DOCTORS

-- ¾ Обстеження (Examinations)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор
-- обсте-ження.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.

-- ■ День тижня (DayOfWeek). День тижня, коли проводиться обстеження.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Має бути в діапазоні від 1 до 7.

-- ■ Час завершення (EndTime). Час завершення обстеження.
-- ▷ Тип даних для зберігання часу.
-- ▷ Не містить null-значення.
-- ▷ Має бути більше, ніж час початку обстеження.

-- ■ Назва (Name). Назва обстеження.
-- ▷ Тип даних — varchar(100).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.

-- ■ Час початку (StartTime). Час початку обстеження.
-- ▷ Тип даних для зберігання часу.
-- ▷ Не містить null-значення.
-- ▷ Має бути в діапазоні від 8:00 до 18:00.

CREATE TABLE Examinations(
	ID SERIAL NOT NULL PRIMARY KEY,
	DayOfWeek INT NOT NULL CHECK (DayOfWeek BETWEEN 1 AND 7),
	EndTime TIME NOT NULL CHECK (EndTime > StartTime),
	Name VARCHAR(100) UNIQUE NOT NULL CHECK(Name != ''),
	StartTime TIME NOT NULL CHECK (StartTime BETWEEN '8:00' AND '18:00')	
)


INSERT INTO Examinations (DayOfWeek, EndTime, Name, StartTime)
VALUES
    (1, '10:00', 'Загальний аналіз крові', '08:00'),
    (2, '11:30', 'Флюорографія грудної клітки', '09:00'),
    (3, '12:00', 'УЗД органів черевної порожнини', '10:00'),
    (4, '13:00', 'МРТ головного мозку', '11:00'),
    (5, '14:00', 'КТ хребта', '12:00'),
    (6, '15:30', 'ЕКГ з навантаженням', '13:00'),
    (7, '16:00', 'Гастроскопія', '14:00'),
    (1, '17:00', 'Колоноскопія', '15:00'),
    (2, '10:00', 'УЗД серця', '08:30'),
    (3, '11:00', 'Аналіз сечі', '09:00'),
    (4, '10:30', 'ПЛР-тест на COVID-19', '09:00'),
    (5, '11:30', 'Зняття кардіограми', '10:00'),
    (6, '12:30', 'Денситометрія', '11:00'),
    (7, '13:30', 'Біохімічний аналіз крові', '12:00'),
    (1, '14:30', 'Цистоскопія', '13:00'),
    (2, '15:30', 'Фібробронхоскопія', '14:00'),
    (3, '16:30', 'УЗД щитоподібної залози', '15:00'),
    (4, '17:30', 'Мамографія', '16:00'),
    (5, '10:00', 'Ендоскопія', '08:00'),
    (6, '11:00', 'Глікемічний профіль', '09:00'),
    (7, '12:00', 'Проба Манту', '10:00'),
    (1, '13:00', 'Імунограма', '11:00'),
    (2, '14:00', 'Рентген легенів', '12:00'),
    (3, '15:00', 'Функціональні проби печінки', '13:00'),
    (4, '16:00', 'УЗД нирок', '14:00'),
    (5, '17:00', 'Доплерографія судин', '15:00'),
    (6, '10:00', 'Аудіометрія', '08:00'),
    (7, '11:00', 'Люмбальна пункція', '09:00'),
    (1, '12:00', 'Тредміл-тест', '10:00'),
    (2, '13:00', 'Капіляроскопія', '11:00'),
    (3, '14:00', 'Тимпанометрія', '12:00'),
    (4, '15:00', 'УЗД молочних залоз', '13:00'),
    (5, '16:00', 'Електроенцефалографія', '14:00'),
    (6, '17:00', 'Ангіографія', '15:00'),
    (7, '10:00', 'Сцинтиграфія', '08:00'),
    (1, '11:00', 'Спірографія', '09:00'),
    (2, '12:00', 'Пункція суглоба', '10:00'),
    (3, '13:00', 'Аналіз на гормони щитоподібної залози', '11:00'),
    (4, '14:00', 'Холтерівське моніторування', '12:00'),
    (5, '15:00', 'Ректороманоскопія', '13:00'),
    (6, '16:00', 'Аналіз на ВІЛ', '14:00'),
    (7, '17:00', 'Аналіз на RW (сифіліс)', '15:00'),
    (1, '10:00', 'Тести на алергію', '08:00'),
    (2, '11:00', 'Копрограма', '09:00'),
    (3, '12:00', 'Проба Шамберга', '10:00'),
    (4, '13:00', 'Ларингоскопія', '11:00'),
    (5, '14:00', 'Риноскопія', '12:00'),
    (6, '15:00', 'Дермографізм', '13:00'),
    (7, '16:00', 'Проба Реберга', '14:00'),
    (1, '17:00', 'Проба Зимницького', '15:00'),
    (2, '10:00', 'Визначення групи крові', '08:00'),
    (3, '11:00', 'Стоматологічний огляд', '09:00'),
    (4, '12:00', 'Офтальмоскопія', '10:00'),
    (5, '13:00', 'Тонометрія', '11:00'),
    (6, '14:00', 'Периметрія', '12:00'),
    (7, '15:00', 'Бронхоскопія', '13:00'),
    (1, '16:00', 'Фарингоскопія', '14:00'),
    (2, '17:00', 'Оцінка стану шкіри', '15:00'),
    (3, '10:00', 'Огляд у гінеколога', '08:00'),
    (4, '11:00', 'Огляд у уролога', '09:00'),
    (5, '12:00', 'Консультація терапевта', '10:00'),
    (6, '13:00', 'Консультація кардіолога', '11:00'),
    (7, '14:00', 'Консультація невропатолога', '12:00'),
    (1, '15:00', 'Консультація гастроентеролога', '13:00'),
    (2, '16:00', 'Консультація ендокринолога', '14:00'),
    (3, '17:00', 'Консультація пульмонолога', '15:00'),
    (4, '10:00', 'Вакцинація від грипу', '08:00'),
    (5, '11:00', 'Вакцинація від кору', '09:00'),
    (6, '12:00', 'Вакцинація від гепатиту В', '10:00'),
    (7, '13:00', 'Вакцинація від правця', '11:00'),
    (1, '14:00', 'Знеболення перед процедурою', '12:00'),
    (2, '15:00', 'Постановка крапельниці', '13:00'),
    (3, '16:00', 'Промивання шлунка', '14:00'),
    (4, '17:00', 'Переливання крові', '15:00'),
    (5, '10:00', 'Перев’язка післяопераційна', '08:00'),
    (6, '11:00', 'Зняття швів', '09:00'),
    (7, '12:00', 'Катетеризація сечового міхура', '10:00'),
    (1, '13:00', 'Масаж спини', '11:00'),
    (2, '14:00', 'Фізіотерапія', '12:00'),
    (3, '15:00', 'Інгаляція', '13:00'),
    (4, '16:00', 'Електрофорез', '14:00'),
    (5, '17:00', 'Магнітотерапія', '15:00'),
    (6, '10:00', 'УВЧ-терапія', '08:00'),
    (7, '11:00', 'Лікувальна гімнастика', '09:00'),
    (1, '12:00', 'Парафінотерапія', '10:00'),
    (2, '13:00', 'Ін’єкція вітамінів', '11:00'),
    (3, '14:00', 'Внутрішньом’язова ін’єкція', '12:00'),
    (4, '15:00', 'Внутрішньовенна ін’єкція', '13:00'),
    (5, '16:00', 'Підшкірна ін’єкція', '14:00'),
    (6, '17:00', 'Антисептична обробка рани', '15:00');

SELECT * 
FROM Examinations 

-- ¾ Палати (Wards)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
---- ▷ Первинний ключ.

-- ■ Корпус (Building). Номер корпусу, де знаходиться
-- палата.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Має бути в діапазоні від 1 до 5.

-- ■ Поверх (Floor). Номер поверху, на якому
-- знаходиться палата.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Не може бути менше, ніж 1.

-- ■ Назва (Name). Назва палати.
-- ▷ Тип даних — varchar(20).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.

CREATE TABLE Wards(
	ID SERIAL NOT NULL PRIMARY KEY,
	Building INT NOT NULL CHECK (Building BETWEEN 1 AND 5),
	Floor INT NOT NULL CHECK (Floor>=1),
	Name VARCHAR(20) UNIQUE NOT NULL CHECK(Name != '')
)

INSERT INTO Wards (Building, Floor, Name)
VALUES
    (1, 1, 'Палата A1'),
    (1, 2, 'Палата A2'),
    (1, 3, 'Палата A3'),
    (1, 4, 'Палата A4'),
    (1, 5, 'Палата A5'),
    (2, 1, 'Палата B1'),
    (2, 2, 'Палата B2'),
    (2, 3, 'Палата B3'),
    (2, 4, 'Палата B4'),
    (2, 5, 'Палата B5'),
    (3, 1, 'Палата C1'),
    (3, 2, 'Палата C2'),
    (3, 3, 'Палата C3'),
    (3, 4, 'Палата C4'),
    (3, 5, 'Палата C5'),
    (4, 1, 'Палата D1'),
    (4, 2, 'Палата D2'),
    (4, 3, 'Палата D3'),
    (4, 4, 'Палата D4'),
    (4, 5, 'Палата D5'),
    (5, 1, 'Палата E1'),
    (5, 2, 'Палата E2'),
    (5, 3, 'Палата E3'),
    (5, 4, 'Палата E4'),
    (5, 5, 'Палата E5'),
    (1, 6, 'Палата A6'),
    (1, 7, 'Палата A7'),
    (2, 6, 'Палата B6'),
    (2, 7, 'Палата B7'),
    (3, 6, 'Палата C6'),
    (3, 7, 'Палата C7'),
    (4, 6, 'Палата D6'),
    (4, 7, 'Палата D7'),
    (5, 6, 'Палата E6'),
    (5, 7, 'Палата E7'),
    (1, 8, 'Палата A8'),
    (2, 8, 'Палата B8'),
    (3, 8, 'Палата C8'),
    (4, 8, 'Палата D8'),
    (5, 8, 'Палата E8'),
    (1, 9, 'Палата A9'),
    (2, 9, 'Палата B9'),
    (3, 9, 'Палата C9'),
    (4, 9, 'Палата D9'),
    (5, 9, 'Палата E9'),
    (1, 10, 'Палата A10'),
    (2, 10, 'Палата B10'),
    (3, 10, 'Палата C10'),
    (4, 10, 'Палата D10'),
    (5, 10, 'Палата E10');

SELECT * 
FROM Wards 